<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Dymo Connect Desktop. Finds and downloads a Dymo Connect Desktop release disk image.</string>
    <key>Identifier</key>
    <string>com.github.paromacs.download.Dymo-Connect-Desktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Dymo Connect Desktop</string>
        <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        <false />
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.dymo.com/dymo/Software/Mac</string>
                <key>re_pattern</key>
                <string>&lt;a href="(?P&lt;url&gt;https://.*/DCDMac.*\.pkg)"&gt;</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/DYMO\ Connect.app</string>
                <key>requirement</key>
                <string>identifier "com.dymo.dymo-connect" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = N3S6676K3E</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
