<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Advitronics ConversationManager disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>nl.paromacs.autopkg.munki.advitronics-conversation-manager</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/advitronics</string>
        <key>NAME</key>
        <string>ConversationManager</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>De Advitronics Conversation Manager voor macOS.
            Voor gebruikers van Advitronics VOIP diensten.</string>
            <key>display_name</key>
            <string>Conversation Manager</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Communication</string>
            <key>developer</key>
            <string>Summa</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>nl.paromacs.autopkg.download.advitronics-conversation-manager</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
