<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads a Ajax PRO Desktop disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.paromacs.munki.Ajax-PRO-Desktop</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/ajax_systems</string>
        <key>NAME</key>
        <string>AjaxPro</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Integrated app for the installation and monitoring business.<br/>
Use the PRO Desktop app to unleash the full potential of Ajax security systems.<br/>
<br/>
<b>Full-scale monitoring</b><br/>
Connect more than 3000 client-owned facilities and monitor everything, even the temperature inside the protected premises.<br/>
<br/>
<b>Detailed summary</b><br/>
Receive exhaustive incident-related data — address, cause of alarm, triggered detector or panic button — and coordinate the rapid response team.<br/>
<br/>
<b>Remote set up</b><br/>
Make changes to the settings of client hubs, test detectors, and arm or disarm facilities without leaving your office.<br/>
<br/>
<b>History of events</b><br/>
Review events that occur at the facility and filter them by type of alarm, malfunction, arming and disarming as well as action of smart sockets and relays.<br/>
<br/>
<b>Customer cards</b><br/>
Create databases of facilities with addresses and contacts of all owners.<br/>
<br/>
<b>Flexible access</b><br/>
Open temporary access to hub settings for installers and users that will be recalled automatically after predetermined time period.<br/>
<br/>
<b>Quick search</b><br/>
Look for protected facilities by name or hub ID.</string>
            <key>display_name</key>
            <string>Ajax PRO Desktop</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Security</string>
            <key>developer</key>
            <string>Ajax Systems Inc</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.paromacs.download.Ajax-PRO-Desktop</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
