<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads a Ajax PRO Desktop disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.paromacs.munki.Ajax-PRO-Desktop</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/ajax_systems</string>
        <key>NAME</key>
        <string>AjaxPro</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Integrated app for the installation and monitoring business.
            Use the PRO Desktop app to unleash the full potential of Ajax security systems.</string>
            <key>display_name</key>
            <string>Ajax PRO Desktop</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Security</string>
            <key>developer</key>
            <string>Ajax Systems Inc</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.paromacs.download.Ajax-PRO-Desktop</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
